dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/cores/arduino/NrfPeripherals.cpp
// NrfPeripherals.cpp - implementation of the small drivers in
// NrfPeripherals.h. Designed to be standalone (no Arduino.h includes) so
// these can be reused outside the core too.

#include "NrfPeripherals.h"
#include "NrfClock.h"
#include <math.h>   // NAN

namespace {

inline volatile uint32_t &reg32(uint32_t base, uint32_t offset) {
    return *reinterpret_cast<volatile uint32_t *>(base + offset);
}

constexpr uint32_t NVIC_BASE  = 0xE000E000UL;
constexpr uint32_t NVIC_ISER0 = 0x100UL;
constexpr uint32_t NVIC_ICER0 = 0x180UL;

inline void enableNvic(uint8_t irq) {
    reg32(NVIC_BASE, NVIC_ISER0 + ((irq >> 5U) * 4UL)) = 1UL << (irq & 0x1FU);
}
inline void disableNvic(uint8_t irq) {
    reg32(NVIC_BASE, NVIC_ICER0 + ((irq >> 5U) * 4UL)) = 1UL << (irq & 0x1FU);
}

// ---- shared register definitions -----------------------------------------

constexpr uint32_t RNG_BASE = 0x4000D000UL;
constexpr uint32_t RNG_TASKS_START   = 0x000UL;
constexpr uint32_t RNG_TASKS_STOP    = 0x004UL;
constexpr uint32_t RNG_EVENTS_VALRDY = 0x100UL;
constexpr uint32_t RNG_CONFIG        = 0x504UL;
constexpr uint32_t RNG_VALUE         = 0x508UL;
constexpr uint32_t RNG_CONFIG_DERCEN = 1UL << 0;

constexpr uint32_t WDT_BASE = 0x40010000UL;
constexpr uint32_t WDT_TASKS_START = 0x000UL;
constexpr uint32_t WDT_EVENTS_TIMEOUT = 0x100UL;
constexpr uint32_t WDT_RUNSTATUS  = 0x400UL;
constexpr uint32_t WDT_REQSTATUS  = 0x404UL;
constexpr uint32_t WDT_CRV        = 0x504UL;
constexpr uint32_t WDT_RREN       = 0x508UL;
constexpr uint32_t WDT_CONFIG     = 0x50CUL;
constexpr uint32_t WDT_RR_BASE    = 0x600UL;        // RR[0..7] @ +i*4
constexpr uint32_t WDT_RR_RELOAD_MAGIC = 0x6E524635UL;  // "nRF5" — required to feed

constexpr uint32_t TEMP_BASE = 0x4000C000UL;
constexpr uint32_t TEMP_TASKS_START   = 0x000UL;
constexpr uint32_t TEMP_TASKS_STOP    = 0x004UL;
constexpr uint32_t TEMP_EVENTS_DATARDY = 0x100UL;
constexpr uint32_t TEMP_TEMP          = 0x508UL;

constexpr uint32_t QDEC_BASE = 0x40012000UL;
constexpr uint32_t QDEC_TASKS_START   = 0x000UL;
constexpr uint32_t QDEC_TASKS_STOP    = 0x004UL;
constexpr uint32_t QDEC_TASKS_READCLRACC = 0x008UL;
constexpr uint32_t QDEC_TASKS_RDCLRACC = 0x00CUL;
constexpr uint32_t QDEC_ENABLE        = 0x500UL;
constexpr uint32_t QDEC_LEDPOL        = 0x504UL;
constexpr uint32_t QDEC_SAMPLEPER     = 0x508UL;
constexpr uint32_t QDEC_SAMPLE        = 0x50CUL;
constexpr uint32_t QDEC_REPORTPER     = 0x510UL;
constexpr uint32_t QDEC_ACC           = 0x514UL;
constexpr uint32_t QDEC_ACCREAD       = 0x518UL;
constexpr uint32_t QDEC_PSEL_LED      = 0x51CUL;
constexpr uint32_t QDEC_PSEL_A        = 0x520UL;
constexpr uint32_t QDEC_PSEL_B        = 0x524UL;
constexpr uint32_t QDEC_DBFEN         = 0x528UL;
constexpr uint32_t QDEC_LEDPRE        = 0x540UL;
constexpr uint32_t QDEC_ACCDBL        = 0x544UL;
constexpr uint32_t QDEC_ACCDBLREAD    = 0x548UL;

// POWER.RESETREAS for "watchdog reset" detection
constexpr uint32_t POWER_BASE = 0x40000000UL;
constexpr uint32_t POWER_RESETREAS = 0x400UL;
constexpr uint32_t RESETREAS_DOG_BIT = 1UL << 1;

bool g_wdtRunning = false;
bool g_qdecRunning = false;
bool g_rngRunning = false;

}  // namespace

// ============================================================================
// NrfRng
// ============================================================================

void NrfRng::begin() {
    reg32(RNG_BASE, RNG_CONFIG) = RNG_CONFIG_DERCEN;
    reg32(RNG_BASE, RNG_EVENTS_VALRDY) = 0UL;
    reg32(RNG_BASE, RNG_TASKS_START) = 1UL;
    g_rngRunning = true;
}

void NrfRng::end() {
    reg32(RNG_BASE, RNG_TASKS_STOP) = 1UL;
    g_rngRunning = false;
}

bool NrfRng::isRunning() { return g_rngRunning; }

void NrfRng::randomBytes(uint8_t *buf, size_t len) {
    if (!g_rngRunning) {
        begin();
    }
    for (size_t i = 0; i < len; ++i) {
        // Wait for VALRDY then read one byte. The bias corrector means each
        // VALRDY may take up to ~120 us; typical ~5 us.
        while (reg32(RNG_BASE, RNG_EVENTS_VALRDY) == 0UL) {}
        buf[i] = static_cast<uint8_t>(reg32(RNG_BASE, RNG_VALUE) & 0xFFUL);
        reg32(RNG_BASE, RNG_EVENTS_VALRDY) = 0UL;
    }
}

uint32_t NrfRng::random32() {
    uint32_t v = 0;
    randomBytes(reinterpret_cast<uint8_t *>(&v), 4U);
    return v;
}

// ============================================================================
// NrfWdt
// ============================================================================

bool NrfWdt::begin(uint32_t timeoutMs, uint8_t channelMask, bool pauseOnHalt) {
    if (g_wdtRunning) {
        // WDT is run-locked once started - we cannot reconfigure.
        return false;
    }
    if (channelMask == 0U) return false;

    // Make sure LFCLK is up.
    if (!nrfLfclkRunning()) {
        nrfStartLfclk();
    }

    // CONFIG: bit 0 = SLEEP (1 = WDT keeps ticking during sleep),
    //         bit 3 = HALT (1 = pause while CPU halted in debug).
    uint32_t config = 1UL;        // run during sleep (we want it to)
    if (pauseOnHalt) config |= (1UL << 3);
    reg32(WDT_BASE, WDT_CONFIG) = config;

    // CRV: counter-reload value, in LFCLK ticks (32768 Hz). For X ms:
    //   ticks = (X * 32768) / 1000
    const uint64_t ticks = (static_cast<uint64_t>(timeoutMs) * 32768ULL) / 1000ULL;
    if (ticks < 1ULL) return false;
    if (ticks > 0xFFFFFFFFULL) return false;
    reg32(WDT_BASE, WDT_CRV) = static_cast<uint32_t>(ticks);

    // RREN: which RR channels participate.
    reg32(WDT_BASE, WDT_RREN) = channelMask;

    reg32(WDT_BASE, WDT_TASKS_START) = 1UL;
    g_wdtRunning = true;
    return true;
}

void NrfWdt::feed(uint8_t channel) {
    if (channel >= MAX_RELOAD_CHANNELS) return;
    reg32(WDT_BASE, WDT_RR_BASE + (channel * 4UL)) = WDT_RR_RELOAD_MAGIC;
}

bool NrfWdt::isRunning() {
    return (reg32(WDT_BASE, WDT_RUNSTATUS) & 1UL) != 0UL;
}

bool NrfWdt::causedLastReset() {
    return (reg32(POWER_BASE, POWER_RESETREAS) & RESETREAS_DOG_BIT) != 0UL;
}

// ============================================================================
// NrfTemp
// ============================================================================

