dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/cores/arduino/NrfPeripherals.cpp
bool NrfTemp::readRaw(int32_t *outQuartersC) {
    if (outQuartersC == nullptr) return false;
    reg32(TEMP_BASE, TEMP_EVENTS_DATARDY) = 0UL;
    reg32(TEMP_BASE, TEMP_TASKS_START) = 1UL;
    // Conversion takes ~36 µs. Spin with a generous timeout.
    for (uint32_t spin = 0; spin < 1000000UL; ++spin) {
        if (reg32(TEMP_BASE, TEMP_EVENTS_DATARDY) != 0UL) {
            *outQuartersC = static_cast<int32_t>(reg32(TEMP_BASE, TEMP_TEMP));
            reg32(TEMP_BASE, TEMP_TASKS_STOP) = 1UL;
            return true;
        }
    }
    reg32(TEMP_BASE, TEMP_TASKS_STOP) = 1UL;
    return false;
}

float NrfTemp::readCelsius() {
    int32_t raw = 0;
    if (!readRaw(&raw)) return NAN;
    return static_cast<float>(raw) * 0.25f;
}

float NrfTemp::readFahrenheit() {
    const float c = readCelsius();
    if (isnan(c)) return NAN;
    return c * (9.0f / 5.0f) + 32.0f;
}

// ============================================================================
// NrfQdec
// ============================================================================

bool NrfQdec::begin(uint8_t pinA, uint8_t pinB, uint8_t pinLed, uint16_t sampleRateHz) {
    if (g_qdecRunning) return false;

    // SAMPLEPER picks the divider for the 32-kHz sampling clock.
    // Values: 0=128us, 1=256us, 2=512us, 3=1024us, 4=2048us, ...
    uint32_t samplePer = 3UL;  // 1024 µs ≈ ~1 kHz default
    switch (sampleRateHz) {
        case 8000: samplePer = 0; break;   // 128 µs
        case 4000: samplePer = 1; break;   // 256 µs
        case 2000: samplePer = 2; break;   // 512 µs
        case 1000: samplePer = 3; break;
        case  500: samplePer = 4; break;
        case  250: samplePer = 5; break;
        case  125: samplePer = 6; break;
        case   64: samplePer = 7; break;
        default: break;
    }

    reg32(QDEC_BASE, QDEC_SAMPLEPER) = samplePer;
    reg32(QDEC_BASE, QDEC_PSEL_A) = pinA;
    reg32(QDEC_BASE, QDEC_PSEL_B) = pinB;
    reg32(QDEC_BASE, QDEC_PSEL_LED) = (pinLed == 0xFFU) ? 0xFFFFFFFFUL : pinLed;
    reg32(QDEC_BASE, QDEC_DBFEN) = 1UL;          // input debouncing on
    reg32(QDEC_BASE, QDEC_REPORTPER) = 0UL;       // 10 samples per report
    reg32(QDEC_BASE, QDEC_ENABLE) = 1UL;
    reg32(QDEC_BASE, QDEC_TASKS_START) = 1UL;
    g_qdecRunning = true;
    return true;
}

void NrfQdec::end() {
    reg32(QDEC_BASE, QDEC_TASKS_STOP) = 1UL;
    reg32(QDEC_BASE, QDEC_ENABLE) = 0UL;
    g_qdecRunning = false;
}

int32_t NrfQdec::readDelta() {
    if (!g_qdecRunning) return 0;
    reg32(QDEC_BASE, QDEC_TASKS_RDCLRACC) = 1UL;
    return static_cast<int32_t>(reg32(QDEC_BASE, QDEC_ACCREAD));
}

int32_t NrfQdec::readPosition() {
    if (!g_qdecRunning) return 0;
    return static_cast<int32_t>(reg32(QDEC_BASE, QDEC_ACC));
}

void NrfQdec::resetPosition() {
    if (!g_qdecRunning) return;
    // RDCLRACC captures ACC into ACCREAD and clears ACC in one shot; the
    // clear is done by the task, so there's nothing more to read here.
    reg32(QDEC_BASE, QDEC_TASKS_RDCLRACC) = 1UL;
}

bool NrfQdec::isRunning() { return g_qdecRunning; }

// ============================================================================
// NrfTimer (TIMER0..TIMER4)
// ============================================================================

namespace {
constexpr uint32_t TIMER0_BASE = 0x40008000UL;
constexpr uint32_t TIMER1_BASE = 0x40009000UL;
constexpr uint32_t TIMER2_BASE = 0x4000A000UL;
constexpr uint32_t TIMER3_BASE = 0x4001A000UL;
constexpr uint32_t TIMER4_BASE = 0x4001B000UL;

constexpr uint32_t TIMER_TASKS_START   = 0x000UL;
constexpr uint32_t TIMER_TASKS_STOP    = 0x004UL;
constexpr uint32_t TIMER_TASKS_CLEAR   = 0x00CUL;
constexpr uint32_t TIMER_TASKS_CAPTURE = 0x040UL;   // +cc*4
constexpr uint32_t TIMER_EVENTS_COMPARE = 0x140UL;  // +cc*4
constexpr uint32_t TIMER_INTENSET      = 0x304UL;
constexpr uint32_t TIMER_INTENCLR      = 0x308UL;
constexpr uint32_t TIMER_MODE          = 0x504UL;
constexpr uint32_t TIMER_BITMODE       = 0x508UL;
constexpr uint32_t TIMER_PRESCALER     = 0x510UL;
constexpr uint32_t TIMER_CC            = 0x540UL;   // CC[0..5] @ +cc*4

constexpr uint32_t TIMER_INTEN_COMPARE_BIT0 = 1UL << 16;
constexpr uint32_t TIMER_BITMODE_32 = 3UL;
constexpr uint32_t TIMER_BITMODE_16 = 0UL;
constexpr uint32_t TIMER_BASE_CLOCK_HZ = 16000000UL;

constexpr uint8_t TIMER0_IRQ = 8U;
constexpr uint8_t TIMER1_IRQ = 9U;
constexpr uint8_t TIMER2_IRQ = 10U;
constexpr uint8_t TIMER3_IRQ = 26U;
constexpr uint8_t TIMER4_IRQ = 27U;

uint32_t timerBaseForIndex(uint8_t index) {
    switch (index) {
        case 0: return TIMER0_BASE;
        case 1: return TIMER1_BASE;
        case 2: return TIMER2_BASE;
        case 3: return TIMER3_BASE;
        case 4: return TIMER4_BASE;
        default: return 0U;
    }
}
uint8_t timerIrqForIndex(uint8_t index) {
    switch (index) {
        case 0: return TIMER0_IRQ;
        case 1: return TIMER1_IRQ;
        case 2: return TIMER2_IRQ;
        case 3: return TIMER3_IRQ;
        case 4: return TIMER4_IRQ;
        default: return 0xFFU;
    }
}
}  // namespace

NrfTimer::NrfTimer(uint8_t index)
    : base_(timerBaseForIndex(index)),
      index_(index),
      irqNumber_(timerIrqForIndex(index)),
      tickHz_(0UL) {
    for (uint8_t i = 0; i < COMPARE_CHANNEL_COUNT; ++i) {
        compareCallbacks_[i] = nullptr;
    }
}

bool NrfTimer::begin(uint32_t tickHz, bool narrow16) {
    if (!isValid() || tickHz == 0UL || tickHz > TIMER_BASE_CLOCK_HZ) {
        return false;
    }
    // Pick the smallest prescaler P with (16 MHz >> P) <= tickHz desired
    // resolution. With P=0 the counter ticks at 16 MHz; P=9 at 31.25 kHz.
    uint32_t prescaler = 0;
    uint32_t clockHz = TIMER_BASE_CLOCK_HZ;
    while (prescaler < 9U && clockHz > tickHz) {
        ++prescaler;
        clockHz >>= 1;
    }

    reg32(base_, TIMER_TASKS_STOP) = 1UL;
    reg32(base_, TIMER_TASKS_CLEAR) = 1UL;
    reg32(base_, TIMER_MODE) = 0UL;   // Timer mode (not Counter)
    reg32(base_, TIMER_BITMODE) = narrow16 ? TIMER_BITMODE_16 : TIMER_BITMODE_32;
    reg32(base_, TIMER_PRESCALER) = prescaler;
    reg32(base_, TIMER_INTENCLR) = 0xFFFFFFFFUL;
    for (uint8_t i = 0; i < COMPARE_CHANNEL_COUNT; ++i) {
        reg32(base_, TIMER_EVENTS_COMPARE + (i * 4U)) = 0UL;
    }
    tickHz_ = clockHz;
    return true;
}

void NrfTimer::end() {
    if (!isValid()) return;
    reg32(base_, TIMER_TASKS_STOP) = 1UL;
    reg32(base_, TIMER_INTENCLR) = 0xFFFFFFFFUL;
    disableNvic(irqNumber_);
    tickHz_ = 0UL;
    for (uint8_t i = 0; i < COMPARE_CHANNEL_COUNT; ++i) {
        compareCallbacks_[i] = nullptr;
    }
}

void NrfTimer::start() { if (isValid()) reg32(base_, TIMER_TASKS_START) = 1UL; }
void NrfTimer::stop()  { if (isValid()) reg32(base_, TIMER_TASKS_STOP)  = 1UL; }
void NrfTimer::clear() { if (isValid()) reg32(base_, TIMER_TASKS_CLEAR) = 1UL; }

uint32_t NrfTimer::counter() {
    if (!isValid()) return 0UL;
    // CAPTURE[5] -> read CC[5] - the convention for "read current count".
    reg32(base_, TIMER_TASKS_CAPTURE + (5U * 4U)) = 1UL;
    return reg32(base_, TIMER_CC + (5U * 4U));
}

void NrfTimer::setCompare(uint8_t cc, uint32_t value) {
    if (!isValid() || cc >= COMPARE_CHANNEL_COUNT) return;
    reg32(base_, TIMER_CC + (cc * 4U)) = value;
}

uint32_t NrfTimer::getCompare(uint8_t cc) const {
    if (!isValid() || cc >= COMPARE_CHANNEL_COUNT) return 0UL;
    return *reinterpret_cast<volatile const uint32_t *>(base_ + TIMER_CC + (cc * 4U));
}

