dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/cores/arduino/NrfPeripherals.cpp
void NrfTimer::attachCompareInterrupt(uint8_t cc, nrfTimerCallback_t cb) {
    if (!isValid() || cc >= COMPARE_CHANNEL_COUNT) return;
    compareCallbacks_[cc] = cb;
    if (cb != nullptr) {
        reg32(base_, TIMER_EVENTS_COMPARE + (cc * 4U)) = 0UL;
        reg32(base_, TIMER_INTENSET) = TIMER_INTEN_COMPARE_BIT0 << cc;
        enableNvic(irqNumber_);
    } else {
        reg32(base_, TIMER_INTENCLR) = TIMER_INTEN_COMPARE_BIT0 << cc;
    }
}

void NrfTimer::detachCompareInterrupt(uint8_t cc) {
    attachCompareInterrupt(cc, nullptr);
}

uint32_t NrfTimer::taskCaptureAddr(uint8_t cc) const {
    if (!isValid() || cc >= COMPARE_CHANNEL_COUNT) return 0UL;
    return base_ + TIMER_TASKS_CAPTURE + (cc * 4U);
}

uint32_t NrfTimer::eventCompareAddr(uint8_t cc) const {
    if (!isValid() || cc >= COMPARE_CHANNEL_COUNT) return 0UL;
    return base_ + TIMER_EVENTS_COMPARE + (cc * 4U);
}

uint32_t NrfTimer::taskStartAddr() const { return isValid() ? base_ + TIMER_TASKS_START : 0UL; }
uint32_t NrfTimer::taskStopAddr()  const { return isValid() ? base_ + TIMER_TASKS_STOP  : 0UL; }

void NrfTimer::serviceIrq() {
    if (!isValid()) return;
    for (uint8_t cc = 0; cc < COMPARE_CHANNEL_COUNT; ++cc) {
        const uint32_t off = TIMER_EVENTS_COMPARE + (cc * 4U);
        if (reg32(base_, off) != 0UL) {
            reg32(base_, off) = 0UL;
            if (compareCallbacks_[cc] != nullptr) {
                compareCallbacks_[cc]();
            }
        }
    }
}

NrfTimer &nrfTimer0() { static NrfTimer t(0); return t; }
NrfTimer &nrfTimer1() { static NrfTimer t(1); return t; }
NrfTimer &nrfTimer2() { static NrfTimer t(2); return t; }
NrfTimer &nrfTimer3() { static NrfTimer t(3); return t; }
NrfTimer &nrfTimer4() { static NrfTimer t(4); return t; }

extern "C" {
void TIMER0_IRQHandler(void) { nrfTimer0().serviceIrq(); }
void TIMER1_IRQHandler(void) { nrfTimer1().serviceIrq(); }
void TIMER2_IRQHandler(void) { nrfTimer2().serviceIrq(); }
void TIMER3_IRQHandler(void) { nrfTimer3().serviceIrq(); }
void TIMER4_IRQHandler(void) { nrfTimer4().serviceIrq(); }
}

// ============================================================================
// NrfNvmc - direct flash erase / write
// ============================================================================

namespace {
constexpr uint32_t NVMC_BASE = 0x4001E000UL;
constexpr uint32_t NVMC_READY     = 0x400UL;
constexpr uint32_t NVMC_CONFIG    = 0x504UL;
constexpr uint32_t NVMC_ERASEPAGE = 0x508UL;
constexpr uint32_t NVMC_ERASEALL  = 0x50CUL;
constexpr uint32_t NVMC_ERASEUICR = 0x514UL;

constexpr uint32_t NVMC_CONFIG_REN = 0UL;
constexpr uint32_t NVMC_CONFIG_WEN = 1UL;
constexpr uint32_t NVMC_CONFIG_EEN = 2UL;

constexpr uint32_t NRF_FLASH_BASE = 0x00000000UL;
constexpr uint32_t NRF_FLASH_SIZE = 0x00100000UL;   // 1 MB on nRF52840
}

bool NrfNvmc::isReady() {
    return (reg32(NVMC_BASE, NVMC_READY) & 1UL) != 0UL;
}

bool NrfNvmc::erasePage(uint32_t flashAddress) {
    if (flashAddress < NRF_FLASH_BASE || flashAddress >= NRF_FLASH_BASE + NRF_FLASH_SIZE) {
        return false;
    }
    if ((flashAddress & (PAGE_SIZE_BYTES - 1U)) != 0U) {
        return false;   // page-misaligned
    }
    while (!isReady()) {}
    reg32(NVMC_BASE, NVMC_CONFIG) = NVMC_CONFIG_EEN;
    while (!isReady()) {}
    reg32(NVMC_BASE, NVMC_ERASEPAGE) = flashAddress;
    while (!isReady()) {}
    reg32(NVMC_BASE, NVMC_CONFIG) = NVMC_CONFIG_REN;
    return true;
}

bool NrfNvmc::eraseRegion(uint32_t flashAddress, uint32_t lengthBytes) {
    if (lengthBytes == 0U) return true;
    if ((flashAddress & (PAGE_SIZE_BYTES - 1U)) != 0U) return false;
    const uint32_t endAddr = flashAddress + lengthBytes;
    for (uint32_t addr = flashAddress; addr < endAddr; addr += PAGE_SIZE_BYTES) {
        if (!erasePage(addr)) return false;
    }
    return true;
}

bool NrfNvmc::writeWord(uint32_t flashAddress, uint32_t word) {
    if ((flashAddress & 0x3U) != 0U) return false;
    if (flashAddress < NRF_FLASH_BASE || flashAddress >= NRF_FLASH_BASE + NRF_FLASH_SIZE) {
        return false;
    }
    while (!isReady()) {}
    reg32(NVMC_BASE, NVMC_CONFIG) = NVMC_CONFIG_WEN;
    while (!isReady()) {}
    *reinterpret_cast<volatile uint32_t *>(flashAddress) = word;
    while (!isReady()) {}
    reg32(NVMC_BASE, NVMC_CONFIG) = NVMC_CONFIG_REN;
    return true;
}

bool NrfNvmc::writeWords(uint32_t flashAddress, const uint32_t *words, uint32_t wordCount) {
    if (words == nullptr) return false;
    for (uint32_t i = 0; i < wordCount; ++i) {
        if (!writeWord(flashAddress + (i * 4U), words[i])) {
            return false;
        }
    }
    return true;
}

bool NrfNvmc::writeBytes(uint32_t flashAddress, const uint8_t *bytes, size_t length) {
    if (bytes == nullptr) return false;
    if ((flashAddress & 0x3U) != 0U) return false;
    while (length >= 4U) {
        uint32_t w = static_cast<uint32_t>(bytes[0])        |
                     (static_cast<uint32_t>(bytes[1]) << 8) |
                     (static_cast<uint32_t>(bytes[2]) << 16) |
                     (static_cast<uint32_t>(bytes[3]) << 24);
        if (!writeWord(flashAddress, w)) return false;
        flashAddress += 4U;
        bytes += 4U;
        length -= 4U;
    }
    if (length > 0U) {
        // Tail: pack remaining bytes into a word with high bytes as 0xFF
        // (so unwritten bits stay erased).
        uint32_t w = 0xFFFFFFFFUL;
        for (size_t i = 0; i < length; ++i) {
            w = (w & ~(0xFFUL << (i * 8U))) | (static_cast<uint32_t>(bytes[i]) << (i * 8U));
        }
        if (!writeWord(flashAddress, w)) return false;
    }
    return true;
}

// ============================================================================
// NrfUicr - User Information Configuration Registers
// ============================================================================

namespace {
constexpr uint32_t UICR_BASE        = 0x10001000UL;
constexpr uint32_t UICR_CUSTOMER0   = 0x080UL;     // CUSTOMER[i] @ +i*4
constexpr uint32_t UICR_NFCPINS     = 0x20CUL;
constexpr uint32_t UICR_REGOUT0     = 0x304UL;

// NVMC controls writes to UICR exactly as it does for main flash.
constexpr uint32_t UICR_NVMC_BASE        = 0x4001E000UL;
constexpr uint32_t UICR_NVMC_READY       = 0x400UL;
constexpr uint32_t UICR_NVMC_CONFIG      = 0x504UL;
constexpr uint32_t UICR_NVMC_ERASEUICR   = 0x514UL;
constexpr uint32_t UICR_NVMC_CFG_REN     = 0UL;
constexpr uint32_t UICR_NVMC_CFG_WEN     = 1UL;
constexpr uint32_t UICR_NVMC_CFG_EEN     = 2UL;

