dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/cores/arduino/NrfPeripherals.cpp
inline uint32_t uicrRead(uint32_t offset) {
    return reg32(UICR_BASE, offset);
}

inline void nvmcWaitReady() {
    while ((reg32(UICR_NVMC_BASE, UICR_NVMC_READY) & 1UL) == 0UL) {}
}

// Write one UICR word. UICR is flash-like: only 1->0 transitions stick, so
// the caller guards the subset rule. Returns false if the value would need a
// 0->1 flip versus the current contents.
bool uicrWrite(uint32_t offset, uint32_t value) {
    const uint32_t cur = uicrRead(offset);
    if ((value & ~cur) != 0U) return false;   // would need a 0->1 flip
    if (value == cur) return true;            // nothing to do
    nvmcWaitReady();
    reg32(UICR_NVMC_BASE, UICR_NVMC_CONFIG) = UICR_NVMC_CFG_WEN;
    nvmcWaitReady();
    reg32(UICR_BASE, offset) = value;
    nvmcWaitReady();
    reg32(UICR_NVMC_BASE, UICR_NVMC_CONFIG) = UICR_NVMC_CFG_REN;
    return true;
}
}  // namespace

NrfUicr::Voltage NrfUicr::regout0Voltage() {
    const uint32_t v = uicrRead(UICR_REGOUT0) & 0x7U;
    // 7 (and the erased 0xFFFFFFFF -> low bits 7) means "factory default 1.8V".
    if (v > static_cast<uint32_t>(V3_3)) return V1_8;
    return static_cast<Voltage>(v);
}

bool NrfUicr::setRegout0Voltage(Voltage v) {
    // Build the target word: all bits high except the 3-bit VOUT field.
    const uint32_t target = 0xFFFFFFF8UL | static_cast<uint32_t>(v);
    return uicrWrite(UICR_REGOUT0, target);
}

bool NrfUicr::nfcPinsAreGpio() {
    // NFCPINS.PROTECT bit0: 1 = NFC antenna pins (default), 0 = GPIO.
    return (uicrRead(UICR_NFCPINS) & 0x1U) == 0U;
}

bool NrfUicr::setNfcPinsAsGpio() {
    const uint32_t target = uicrRead(UICR_NFCPINS) & ~0x1UL;   // clear PROTECT
    return uicrWrite(UICR_NFCPINS, target);
}

uint32_t NrfUicr::readCustomer(uint8_t index) {
    if (index >= CUSTOMER_COUNT) return 0xFFFFFFFFUL;
    return uicrRead(UICR_CUSTOMER0 + (static_cast<uint32_t>(index) * 4U));
}

bool NrfUicr::writeCustomer(uint8_t index, uint32_t value) {
    if (index >= CUSTOMER_COUNT) return false;
    return uicrWrite(UICR_CUSTOMER0 + (static_cast<uint32_t>(index) * 4U), value);
}

bool NrfUicr::eraseAll() {
    nvmcWaitReady();
    reg32(UICR_NVMC_BASE, UICR_NVMC_CONFIG) = UICR_NVMC_CFG_EEN;
    nvmcWaitReady();
    reg32(UICR_NVMC_BASE, UICR_NVMC_ERASEUICR) = 1UL;
    nvmcWaitReady();
    reg32(UICR_NVMC_BASE, UICR_NVMC_CONFIG) = UICR_NVMC_CFG_REN;
    return true;
}

// ============================================================================
// NrfPpi - peripheral interconnect
// ============================================================================

namespace {
constexpr uint32_t PPI_BASE = 0x4001F000UL;
constexpr uint32_t PPI_CHEN     = 0x500UL;
constexpr uint32_t PPI_CHENSET  = 0x504UL;
constexpr uint32_t PPI_CHENCLR  = 0x508UL;
constexpr uint32_t PPI_CH_EEP_BASE = 0x510UL;   // CH[i].EEP @ +i*8
constexpr uint32_t PPI_CH_TEP_BASE = 0x514UL;   // CH[i].TEP @ +i*8

uint32_t g_ppiAllocated = 0;   // bit i = channel i in use
}

uint8_t NrfPpi::allocateChannel() {
    for (uint8_t ch = 0; ch < USER_CHANNEL_COUNT; ++ch) {
        if ((g_ppiAllocated & (1UL << ch)) == 0UL) {
            g_ppiAllocated |= (1UL << ch);
            return ch;
        }
    }
    return INVALID_CHANNEL;
}

void NrfPpi::releaseChannel(uint8_t channel) {
    if (channel >= USER_CHANNEL_COUNT) return;
    disable(channel);
    g_ppiAllocated &= ~(1UL << channel);
}

bool NrfPpi::configure(uint8_t channel, uint32_t eventAddr, uint32_t taskAddr) {
    if (channel >= USER_CHANNEL_COUNT) return false;
    if (eventAddr == 0UL || taskAddr == 0UL) return false;
    reg32(PPI_BASE, PPI_CH_EEP_BASE + (channel * 8UL)) = eventAddr;
    reg32(PPI_BASE, PPI_CH_TEP_BASE + (channel * 8UL)) = taskAddr;
    return true;
}

void NrfPpi::enable(uint8_t channel) {
    if (channel >= USER_CHANNEL_COUNT) return;
    reg32(PPI_BASE, PPI_CHENSET) = 1UL << channel;
}

void NrfPpi::disable(uint8_t channel) {
    if (channel >= USER_CHANNEL_COUNT) return;
    reg32(PPI_BASE, PPI_CHENCLR) = 1UL << channel;
}

bool NrfPpi::isEnabled(uint8_t channel) {
    if (channel >= USER_CHANNEL_COUNT) return false;
    return (reg32(PPI_BASE, PPI_CHEN) & (1UL << channel)) != 0UL;
}

uint8_t NrfPpi::wire(uint32_t eventAddr, uint32_t taskAddr) {
    const uint8_t ch = allocateChannel();
    if (ch == INVALID_CHANNEL) return INVALID_CHANNEL;
    if (!configure(ch, eventAddr, taskAddr)) {
        releaseChannel(ch);
        return INVALID_CHANNEL;
    }
    enable(ch);
    return ch;
}

// ============================================================================
// NrfEgu (EGU0..EGU5)
// ============================================================================

namespace {
constexpr uint32_t EGU_BASE_LIST[6] = {
    0x40014000UL, 0x40015000UL, 0x40016000UL,
    0x40017000UL, 0x40018000UL, 0x40019000UL,
};
constexpr uint8_t EGU_IRQ_LIST[6] = { 20, 21, 22, 23, 24, 25 };

constexpr uint32_t EGU_TASKS_TRIGGER     = 0x000UL;   // +ch*4
constexpr uint32_t EGU_EVENTS_TRIGGERED  = 0x100UL;   // +ch*4
constexpr uint32_t EGU_INTENSET          = 0x304UL;
constexpr uint32_t EGU_INTENCLR          = 0x308UL;
}

NrfEgu::NrfEgu(uint8_t index)
    : base_(index < 6 ? EGU_BASE_LIST[index] : 0U),
      index_(index),
      irqNumber_(index < 6 ? EGU_IRQ_LIST[index] : 0xFFU) {
    for (uint8_t i = 0; i < CHANNEL_COUNT; ++i) callbacks_[i] = nullptr;
}

void NrfEgu::trigger(uint8_t channel) {
    if (!isValid() || channel >= CHANNEL_COUNT) return;
    reg32(base_, EGU_TASKS_TRIGGER + (channel * 4U)) = 1UL;
}

void NrfEgu::attachInterrupt(uint8_t channel, nrfEguCallback_t cb) {
    if (!isValid() || channel >= CHANNEL_COUNT) return;
    callbacks_[channel] = cb;
    if (cb != nullptr) {
        reg32(base_, EGU_EVENTS_TRIGGERED + (channel * 4U)) = 0UL;
        reg32(base_, EGU_INTENSET) = 1UL << channel;
        enableNvic(irqNumber_);
    } else {
        reg32(base_, EGU_INTENCLR) = 1UL << channel;
    }
}

void NrfEgu::detachInterrupt(uint8_t channel) { attachInterrupt(channel, nullptr); }

uint32_t NrfEgu::taskTriggerAddr(uint8_t channel) const {
    if (!isValid() || channel >= CHANNEL_COUNT) return 0UL;
    return base_ + EGU_TASKS_TRIGGER + (channel * 4U);
}
uint32_t NrfEgu::eventTriggeredAddr(uint8_t channel) const {
    if (!isValid() || channel >= CHANNEL_COUNT) return 0UL;
    return base_ + EGU_EVENTS_TRIGGERED + (channel * 4U);
}

void NrfEgu::serviceIrq() {
    if (!isValid()) return;
    for (uint8_t ch = 0; ch < CHANNEL_COUNT; ++ch) {
        const uint32_t off = EGU_EVENTS_TRIGGERED + (ch * 4U);
        if (reg32(base_, off) != 0UL) {
            reg32(base_, off) = 0UL;
            if (callbacks_[ch] != nullptr) callbacks_[ch]();
        }
    }
}

NrfEgu &nrfEgu0() { static NrfEgu e(0); return e; }
NrfEgu &nrfEgu1() { static NrfEgu e(1); return e; }
NrfEgu &nrfEgu2() { static NrfEgu e(2); return e; }
NrfEgu &nrfEgu3() { static NrfEgu e(3); return e; }
NrfEgu &nrfEgu4() { static NrfEgu e(4); return e; }
NrfEgu &nrfEgu5() { static NrfEgu e(5); return e; }

