dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/cores/arduino/NrfPeripherals.cpp
extern "C" {
void SWI0_EGU0_IRQHandler(void) { nrfEgu0().serviceIrq(); }
void SWI1_EGU1_IRQHandler(void) { nrfEgu1().serviceIrq(); }
void SWI2_EGU2_IRQHandler(void) { nrfEgu2().serviceIrq(); }
void SWI3_EGU3_IRQHandler(void) { nrfEgu3().serviceIrq(); }
void SWI4_EGU4_IRQHandler(void) { nrfEgu4().serviceIrq(); }
void SWI5_EGU5_IRQHandler(void) { nrfEgu5().serviceIrq(); }
}

// ============================================================================
// NrfComp - analog comparator
// ============================================================================

namespace {
constexpr uint32_t COMP_BASE = 0x40013000UL;
constexpr uint32_t COMP_TASKS_START   = 0x000UL;
constexpr uint32_t COMP_TASKS_STOP    = 0x004UL;
constexpr uint32_t COMP_TASKS_SAMPLE  = 0x008UL;
constexpr uint32_t COMP_EVENTS_READY  = 0x100UL;
constexpr uint32_t COMP_EVENTS_DOWN   = 0x104UL;
constexpr uint32_t COMP_EVENTS_UP     = 0x108UL;
constexpr uint32_t COMP_EVENTS_CROSS  = 0x10CUL;
constexpr uint32_t COMP_INTENSET      = 0x304UL;
constexpr uint32_t COMP_INTENCLR      = 0x308UL;
constexpr uint32_t COMP_RESULT        = 0x400UL;
constexpr uint32_t COMP_ENABLE        = 0x500UL;
constexpr uint32_t COMP_PSEL          = 0x504UL;
constexpr uint32_t COMP_REFSEL        = 0x508UL;
constexpr uint32_t COMP_EXTREFSEL     = 0x50CUL;
constexpr uint32_t COMP_TH            = 0x530UL;
constexpr uint32_t COMP_MODE          = 0x534UL;
constexpr uint32_t COMP_HYST          = 0x538UL;

constexpr uint8_t COMP_IRQ = 19U;   // COMP_LPCOMP_IRQHandler

nrfCompCallback_t g_compCallback = nullptr;
}

bool NrfComp::begin(InputPin input, Reference ref) {
    reg32(COMP_BASE, COMP_ENABLE) = 0UL;
    reg32(COMP_BASE, COMP_PSEL) = static_cast<uint32_t>(input);
    reg32(COMP_BASE, COMP_REFSEL) = static_cast<uint32_t>(ref);
    reg32(COMP_BASE, COMP_TH) = (0x10UL << 8) | 0x10UL;   // VUP=VDOWN, middle threshold
    reg32(COMP_BASE, COMP_MODE) = 0UL;     // single-ended
    reg32(COMP_BASE, COMP_HYST) = 0UL;
    reg32(COMP_BASE, COMP_ENABLE) = 1UL;

    reg32(COMP_BASE, COMP_EVENTS_READY) = 0UL;
    reg32(COMP_BASE, COMP_TASKS_START) = 1UL;
    // Wait for READY.
    for (uint32_t spin = 0; spin < 100000UL; ++spin) {
        if (reg32(COMP_BASE, COMP_EVENTS_READY) != 0UL) return true;
    }
    return false;
}

void NrfComp::end() {
    reg32(COMP_BASE, COMP_TASKS_STOP) = 1UL;
    reg32(COMP_BASE, COMP_ENABLE) = 0UL;
    reg32(COMP_BASE, COMP_INTENCLR) = 0xFFFFFFFFUL;
    disableNvic(COMP_IRQ);
    g_compCallback = nullptr;
}

bool NrfComp::isAbove() {
    reg32(COMP_BASE, COMP_TASKS_SAMPLE) = 1UL;
    return (reg32(COMP_BASE, COMP_RESULT) & 1UL) != 0UL;
}

void NrfComp::attachInterrupt(Mode mode, nrfCompCallback_t cb) {
    g_compCallback = cb;
    reg32(COMP_BASE, COMP_INTENCLR) = 0xFFFFFFFFUL;
    if (cb == nullptr) return;
    reg32(COMP_BASE, COMP_EVENTS_DOWN) = 0UL;
    reg32(COMP_BASE, COMP_EVENTS_UP)   = 0UL;
    reg32(COMP_BASE, COMP_EVENTS_CROSS) = 0UL;
    uint32_t inten = 0UL;
    switch (mode) {
        case MODE_UP:    inten = 1UL << 2; break;
        case MODE_DOWN:  inten = 1UL << 1; break;
        case MODE_CROSS:
        default:         inten = 1UL << 3; break;
    }
    reg32(COMP_BASE, COMP_INTENSET) = inten;
    enableNvic(COMP_IRQ);
}

void NrfComp::detachInterrupt() { attachInterrupt(MODE_CROSS, nullptr); }

void NrfComp::serviceIrq() {
    // Clear any fired events; call the user callback once per IRQ entry.
    bool fired = false;
    if (reg32(COMP_BASE, COMP_EVENTS_CROSS) != 0UL) { reg32(COMP_BASE, COMP_EVENTS_CROSS) = 0UL; fired = true; }
    if (reg32(COMP_BASE, COMP_EVENTS_UP)    != 0UL) { reg32(COMP_BASE, COMP_EVENTS_UP)    = 0UL; fired = true; }
    if (reg32(COMP_BASE, COMP_EVENTS_DOWN)  != 0UL) { reg32(COMP_BASE, COMP_EVENTS_DOWN)  = 0UL; fired = true; }
    if (fired && g_compCallback != nullptr) g_compCallback();
}

// ============================================================================
// NrfLpComp - low-power comparator (shares base 0x40013000 + IRQ 19 with COMP)
// ============================================================================

namespace {
constexpr uint32_t LPCOMP_BASE           = 0x40013000UL;
constexpr uint32_t LPCOMP_TASKS_START    = 0x000UL;
constexpr uint32_t LPCOMP_TASKS_STOP     = 0x004UL;
constexpr uint32_t LPCOMP_TASKS_SAMPLE   = 0x008UL;
constexpr uint32_t LPCOMP_EVENTS_READY   = 0x100UL;
constexpr uint32_t LPCOMP_EVENTS_DOWN    = 0x104UL;
constexpr uint32_t LPCOMP_EVENTS_UP      = 0x108UL;
constexpr uint32_t LPCOMP_EVENTS_CROSS   = 0x10CUL;
constexpr uint32_t LPCOMP_INTENSET       = 0x304UL;
constexpr uint32_t LPCOMP_INTENCLR       = 0x308UL;
constexpr uint32_t LPCOMP_RESULT         = 0x400UL;
constexpr uint32_t LPCOMP_ENABLE         = 0x500UL;
constexpr uint32_t LPCOMP_PSEL           = 0x504UL;
constexpr uint32_t LPCOMP_REFSEL         = 0x508UL;
constexpr uint32_t LPCOMP_ANADETECT      = 0x520UL;
constexpr uint32_t LPCOMP_HYST           = 0x538UL;

constexpr uint8_t LPCOMP_IRQ = 19U;   // COMP_LPCOMP_IRQHandler (shared)

nrfLpCompCallback_t g_lpcompCallback = nullptr;
}

bool NrfLpComp::begin(InputPin input, Reference ref, bool hysteresis) {
    reg32(LPCOMP_BASE, LPCOMP_ENABLE) = 0UL;     // takes the block from COMP too
    reg32(LPCOMP_BASE, LPCOMP_PSEL)   = static_cast<uint32_t>(input);
    reg32(LPCOMP_BASE, LPCOMP_REFSEL) = static_cast<uint32_t>(ref);
    reg32(LPCOMP_BASE, LPCOMP_HYST)   = hysteresis ? 1UL : 0UL;
    reg32(LPCOMP_BASE, LPCOMP_ANADETECT) = 0UL;  // default CROSS
    reg32(LPCOMP_BASE, LPCOMP_ENABLE) = 1UL;     // LPCOMP enable value

    reg32(LPCOMP_BASE, LPCOMP_EVENTS_READY) = 0UL;
    reg32(LPCOMP_BASE, LPCOMP_TASKS_START)  = 1UL;
    for (uint32_t spin = 0; spin < 100000UL; ++spin) {
        if (reg32(LPCOMP_BASE, LPCOMP_EVENTS_READY) != 0UL) return true;
    }
    return false;
}

void NrfLpComp::end() {
    reg32(LPCOMP_BASE, LPCOMP_TASKS_STOP) = 1UL;
    reg32(LPCOMP_BASE, LPCOMP_ENABLE)     = 0UL;
    reg32(LPCOMP_BASE, LPCOMP_INTENCLR)   = 0xFFFFFFFFUL;
    disableNvic(LPCOMP_IRQ);
    g_lpcompCallback = nullptr;
}

