dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/cores/arduino/NrfPeripherals.cpp
bool NrfLpComp::isAbove() {
    reg32(LPCOMP_BASE, LPCOMP_TASKS_SAMPLE) = 1UL;
    return (reg32(LPCOMP_BASE, LPCOMP_RESULT) & 1UL) != 0UL;
}

void NrfLpComp::attachInterrupt(Mode mode, nrfLpCompCallback_t cb) {
    g_lpcompCallback = cb;
    reg32(LPCOMP_BASE, LPCOMP_INTENCLR) = 0xFFFFFFFFUL;
    if (cb == nullptr) return;
    // ANADETECT picks which crossing the analog block flags: 0 cross, 1 up,
    // 2 down. Drive the matching event + interrupt.
    reg32(LPCOMP_BASE, LPCOMP_EVENTS_DOWN)  = 0UL;
    reg32(LPCOMP_BASE, LPCOMP_EVENTS_UP)    = 0UL;
    reg32(LPCOMP_BASE, LPCOMP_EVENTS_CROSS) = 0UL;
    uint32_t anadetect = 0UL;
    uint32_t inten = 0UL;
    switch (mode) {
        case MODE_UP:    anadetect = 1UL; inten = 1UL << 2; break;
        case MODE_DOWN:  anadetect = 2UL; inten = 1UL << 1; break;
        case MODE_CROSS:
        default:         anadetect = 0UL; inten = 1UL << 3; break;
    }
    reg32(LPCOMP_BASE, LPCOMP_ANADETECT) = anadetect;
    reg32(LPCOMP_BASE, LPCOMP_INTENSET)  = inten;
    enableNvic(LPCOMP_IRQ);
}

void NrfLpComp::detachInterrupt() { attachInterrupt(MODE_CROSS, nullptr); }

void NrfLpComp::serviceIrq() {
    bool fired = false;
    if (reg32(LPCOMP_BASE, LPCOMP_EVENTS_CROSS) != 0UL) { reg32(LPCOMP_BASE, LPCOMP_EVENTS_CROSS) = 0UL; fired = true; }
    if (reg32(LPCOMP_BASE, LPCOMP_EVENTS_UP)    != 0UL) { reg32(LPCOMP_BASE, LPCOMP_EVENTS_UP)    = 0UL; fired = true; }
    if (reg32(LPCOMP_BASE, LPCOMP_EVENTS_DOWN)  != 0UL) { reg32(LPCOMP_BASE, LPCOMP_EVENTS_DOWN)  = 0UL; fired = true; }
    if (fired && g_lpcompCallback != nullptr) g_lpcompCallback();
}

// COMP and LPCOMP share IRQ 19. They're mutually exclusive, so dispatching to
// both is safe - only the active peripheral has pending events to clear.
extern "C" void COMP_LPCOMP_IRQHandler(void) {
    NrfComp::serviceIrq();
    NrfLpComp::serviceIrq();
}

// ============================================================================
// NrfMwu - memory watch unit
// ============================================================================

namespace {
constexpr uint32_t MWU_BASE = 0x40020000UL;
constexpr uint32_t MWU_INTENSET = 0x304UL;
constexpr uint32_t MWU_INTENCLR = 0x308UL;
constexpr uint32_t MWU_REGIONEN = 0x510UL;
constexpr uint32_t MWU_REGIONENSET = 0x514UL;
constexpr uint32_t MWU_REGIONENCLR = 0x518UL;
constexpr uint32_t MWU_REGION_BASE = 0x600UL;   // REGION[i].START @ +i*16
constexpr uint32_t MWU_REGION_START_OFF = 0x000UL;
constexpr uint32_t MWU_REGION_END_OFF   = 0x004UL;
constexpr uint32_t MWU_PEREGION_RA      = 0x668UL;   // PERREGION[i].EVENTS_RAMATCH base
constexpr uint32_t MWU_PEREGION_WA      = 0x66CUL;   // PERREGION[i].EVENTS_WAMATCH base
constexpr uint32_t MWU_PEREGION_STRIDE  = 0x024UL;

constexpr uint8_t MWU_IRQ = 32U;   // MWU_IRQn

nrfMwuCallback_t g_mwuCallback = nullptr;
}

bool NrfMwu::watchRegion(uint8_t region, uint32_t startAddr, uint32_t endAddr,
                          bool catchWrites, bool catchReads) {
    if (region >= REGION_COUNT) return false;
    if (endAddr <= startAddr) return false;

    // Set region bounds.
    *reinterpret_cast<volatile uint32_t *>(MWU_BASE + MWU_REGION_BASE + (region * 16U)) = startAddr;
    *reinterpret_cast<volatile uint32_t *>(MWU_BASE + MWU_REGION_BASE + (region * 16U) + 4U) = endAddr;

    // Enable read/write detection on this region.
    uint32_t enableMask = 0UL;
    if (catchReads)  enableMask |= (1UL << (region * 2U));        // RA bit
    if (catchWrites) enableMask |= (1UL << (region * 2U + 1U));   // WA bit
    reg32(MWU_BASE, MWU_REGIONENSET) = enableMask;
    return true;
}

void NrfMwu::unwatchRegion(uint8_t region) {
    if (region >= REGION_COUNT) return;
    reg32(MWU_BASE, MWU_REGIONENCLR) = (3UL << (region * 2U));
}

void NrfMwu::attachInterrupt(nrfMwuCallback_t cb) {
    g_mwuCallback = cb;
    if (cb == nullptr) {
        reg32(MWU_BASE, MWU_INTENCLR) = 0xFFFFFFFFUL;
        return;
    }
    // Enable RAMATCH + WAMATCH IRQ for all 4 regions.
    uint32_t inten = 0UL;
    for (uint8_t i = 0; i < REGION_COUNT; ++i) {
        inten |= (1UL << (i * 2U));        // RAMATCH[i]
        inten |= (1UL << (i * 2U + 1U));   // WAMATCH[i]
    }
    reg32(MWU_BASE, MWU_INTENSET) = inten;
    enableNvic(MWU_IRQ);
}

void NrfMwu::detachInterrupt() { attachInterrupt(nullptr); }

void NrfMwu::serviceIrq() {
    if (g_mwuCallback == nullptr) return;
    // For each region, check both event types and clear.
    for (uint8_t i = 0; i < REGION_COUNT; ++i) {
        const uint32_t raOff = MWU_PEREGION_RA + (i * MWU_PEREGION_STRIDE);
        const uint32_t waOff = MWU_PEREGION_WA + (i * MWU_PEREGION_STRIDE);
        if (reg32(MWU_BASE, raOff) != 0UL) {
            reg32(MWU_BASE, raOff) = 0UL;
            g_mwuCallback(/*addr*/ 0UL, /*write*/ false);
        }
        if (reg32(MWU_BASE, waOff) != 0UL) {
            reg32(MWU_BASE, waOff) = 0UL;
            g_mwuCallback(/*addr*/ 0UL, /*write*/ true);
        }
    }
}

extern "C" void MWU_IRQHandler(void) { NrfMwu::serviceIrq(); }

// ============================================================================
// NrfGpioteOut - GPIOTE output channel for PPI use
// ============================================================================

namespace {
constexpr uint32_t GPIOTE_BASE = 0x40006000UL;
constexpr uint32_t GPIOTE_TASKS_OUT_BASE = 0x000UL;   // CH[i] @ +i*4
constexpr uint32_t GPIOTE_TASKS_SET_BASE = 0x030UL;
constexpr uint32_t GPIOTE_TASKS_CLR_BASE = 0x060UL;
constexpr uint32_t GPIOTE_CONFIG_BASE    = 0x510UL;   // CH[i].CONFIG @ +i*4

uint8_t g_gpioteOutAllocated = 0;   // bit i = CH[i] in use as output

// CONFIG layout:
//   bits 0..1   MODE (0=disabled, 1=event input, 3=task output)
//   bits 8..12  PSEL pin number
//   bit  13     PORT (0=P0, 1=P1)
//   bits 16..17 POLARITY (0=none, 1=low->high, 2=high->low, 3=toggle)
//   bit  20     OUTINIT (initial output value when mode=3)

uint32_t gpioteConfigForOutput(uint8_t pin, bool initialHigh, uint8_t taskMode) {
    const uint32_t pinIdx = pin & 0x1FU;
    const uint32_t port = (pin >> 5U) & 1U;
    uint32_t cfg = 3UL;                 // MODE = task output
    cfg |= (pinIdx << 8);               // PSEL
    cfg |= (port << 13);                // PORT
    cfg |= (static_cast<uint32_t>(taskMode) << 16);   // POLARITY
    if (initialHigh) cfg |= (1UL << 20);
    return cfg;
}
}

uint8_t NrfGpioteOut::allocate(uint8_t pin, bool initialHigh, TaskMode taskMode) {
    for (uint8_t ch = 0; ch < 8U; ++ch) {
        if ((g_gpioteOutAllocated & (1U << ch)) != 0U) continue;
        g_gpioteOutAllocated |= (1U << ch);
        reg32(GPIOTE_BASE, GPIOTE_CONFIG_BASE + (ch * 4U)) =
            gpioteConfigForOutput(pin, initialHigh, static_cast<uint8_t>(taskMode));
        return ch;
    }
    return INVALID_CHANNEL;
}

void NrfGpioteOut::release(uint8_t channel) {
    if (channel >= 8U) return;
    reg32(GPIOTE_BASE, GPIOTE_CONFIG_BASE + (channel * 4U)) = 0UL;
    g_gpioteOutAllocated &= ~(1U << channel);
}

void NrfGpioteOut::triggerOut(uint8_t channel) {
    if (channel >= 8U) return;
    reg32(GPIOTE_BASE, GPIOTE_TASKS_OUT_BASE + (channel * 4U)) = 1UL;
}

uint32_t NrfGpioteOut::taskOutAddr(uint8_t channel) {
    if (channel >= 8U) return 0UL;
    return GPIOTE_BASE + GPIOTE_TASKS_OUT_BASE + (channel * 4U);
}
uint32_t NrfGpioteOut::taskSetAddr(uint8_t channel) {
    if (channel >= 8U) return 0UL;
    return GPIOTE_BASE + GPIOTE_TASKS_SET_BASE + (channel * 4U);
}
uint32_t NrfGpioteOut::taskClrAddr(uint8_t channel) {
    if (channel >= 8U) return 0UL;
    return GPIOTE_BASE + GPIOTE_TASKS_CLR_BASE + (channel * 4U);
}
